[
  {
    "nickname": "Superman",
    "real_name": "Clark Kent",
    "origin_description": "He was born Kal-El on the planet Krypton, before being rocketed to Earth as an infant by his scientist father Jor-El, moments before Krypton's destruction.",
    "superpowers": "Solar energy absorption and healing factor, solar flare and heat vision, solar invulnerability, flight.",
    "catch_phrase": "Look, up in the sky, it's a bird, it's a plane, it's Superman!",
    "Images": ["superman.jpg"]
  },
  {
    "nickname": "Batman",
    "real_name": "Bruce Wayne",
    "origin_description": "After witnessing the murder of his parents, Bruce Wayne dedicated his life to fighting crime and became the vigilante known as Batman.",
    "superpowers": "Genius-level intellect, expert martial artist, peak human physical condition, access to high-tech equipment.",
    "catch_phrase": "I am vengeance, I am the night, I am Batman!",
    "Images": ["batman.jpg"]
  },
  {
    "nickname": "Wonder Woman",
    "real_name": "Diana Prince",
    "origin_description": "Princess of the Amazons, Diana was sculpted from clay by her mother and given life by the Greek gods.",
    "superpowers": "Superhuman strength, speed, agility, and endurance; expert combatant; wielding magical weapons.",
    "catch_phrase": "In the name of all that is good, your wrath upon this world is over!",
    "Images": ["wonder_woman.jpg"]
  },
  {
    "nickname": "Spider-Man",
    "real_name": "Peter Parker",
    "origin_description": "Bitten by a radioactive spider, Peter Parker gained superhuman abilities and a responsibility to use them for good.",
    "superpowers": "Wall-crawling, superhuman agility and strength, spider-sense, web-shooting.",
    "catch_phrase": "With great power comes great responsibility.",
    "Images": ["spider_man.jpg"]
  },
  {
    "nickname": "Iron Man",
    "real_name": "Tony Stark",
    "origin_description": "After being kidnapped and forced to build a weapon, billionaire genius Tony Stark created a powered suit of armor to escape and became Iron Man.",
    "superpowers": "Genius-level intellect, skilled engineer, powered armor suits with advanced technology.",
    "catch_phrase": "I am Iron Man.",
    "Images": ["iron_man.jpg"]
  },
  {
    "nickname": "Captain America",
    "real_name": "Steve Rogers",
    "origin_description": "A frail young man enhanced to the peak of human physicality by an experimental serum during World War II.",
    "superpowers": "Superhuman strength, agility, endurance, and enhanced reflexes; master tactician and hand-to-hand combatant.",
    "catch_phrase": "I can do this all day.",
    "Images": ["captain_america.jpg"]
  },
  {
    "nickname": "Thor",
    "real_name": "Thor Odinson",
    "origin_description": "The Norse god of thunder, Thor wields the enchanted hammer Mjölnir and fights to protect both Asgard and Earth.",
    "superpowers": "Superhuman strength, speed, durability, weather manipulation, flight with Mjölnir.",
    "catch_phrase": "For Asgard!",
    "Images": ["thor.jpg"]
  },
  {
    "nickname": "Hulk",
    "real_name": "Bruce Banner",
    "origin_description": "Exposed to gamma radiation, Bruce Banner transforms into the Hulk when he experiences extreme anger.",
    "superpowers": "Immense superhuman strength, durability, and regenerative healing; strength increases with rage.",
    "catch_phrase": "HULK SMASH!",
    "Images": ["hulk.jpg"]
  },
  {
    "nickname": "Black Widow",
    "real_name": "Natasha Romanoff",
    "origin_description": "A former Russian spy and assassin, Natasha Romanoff became a member of S.H.I.E.L.D. and an Avenger.",
    "superpowers": "Expert martial artist, marksman, master spy, enhanced physical abilities.",
    "catch_phrase": "I’m not the only monster on the team.",
    "Images": ["black_widow.jpg"]
  },
  {
    "nickname": "Flash",
    "real_name": "Barry Allen",
    "origin_description": "Struck by lightning and doused in chemicals, Barry Allen gains the ability to move at superhuman speeds.",
    "superpowers": "Super speed, time travel, and the ability to manipulate the Speed Force.",
    "catch_phrase": "I am the fastest man alive.",
    "Images": ["flash.jpg"]
  },
  {
    "nickname": "Green Lantern",
    "real_name": "Hal Jordan",
    "origin_description": "Test pilot Hal Jordan is chosen by the Green Lantern Corps to wield a power ring that can create anything he imagines.",
    "superpowers": "Energy manipulation, flight, constructs created from willpower.",
    "catch_phrase": "In brightest day, in blackest night…",
    "Images": ["green_lantern.jpg"]
  },
  {
    "nickname": "Aquaman",
    "real_name": "Arthur Curry",
    "origin_description": "The half-human, half-Atlantean prince of Atlantis, Aquaman defends the oceans and the surface world.",
    "superpowers": "Superhuman strength, aquatic abilities, telepathic control over marine life.",
    "catch_phrase": "I am Aquaman!",
    "Images": ["aquaman.jpg"]
  },
  {
    "nickname": "Deadpool",
    "real_name": "Wade Wilson",
    "origin_description": "A former special forces operative turned mercenary, Wade Wilson gains regenerative abilities and becomes the antihero Deadpool.",
    "superpowers": "Regenerative healing factor, expert marksman and swordsman, breaking the fourth wall.",
    "catch_phrase": "Maximum effort!",
    "Images": ["deadpool.jpg"]
  },
  {
    "nickname": "Wolverine",
    "real_name": "Logan",
    "origin_description": "A mutant with animal-like senses, enhanced physical capabilities, and retractable claws, Logan is a fierce warrior.",
    "superpowers": "Regenerative healing factor, enhanced senses, and retractable claws coated with adamantium.",
    "catch_phrase": "I’m the best there is at what I do.",
    "Images": ["wolverine.jpg"]
  },
  {
    "nickname": "Doctor Strange",
    "real_name": "Stephen Strange",
    "origin_description": "A former neurosurgeon, Stephen Strange becomes the Sorcerer Supreme after a life-changing accident.",
    "superpowers": "Mastery of magic, spell-casting, and interdimensional travel.",
    "catch_phrase": "I’m sorry, Stephen. I can’t help you.",
    "Images": ["doctor_strange.jpg"]
  },
  {
    "nickname": "Black Panther",
    "real_name": "T'Challa",
    "origin_description": "The king of Wakanda, T'Challa takes on the mantle of Black Panther to protect his nation and the world.",
    "superpowers": "Enhanced agility, strength, and reflexes; expert tactician and hand-to-hand combatant.",
    "catch_phrase": "Wakanda forever!",
    "Images": ["black_panther.jpg"]
  },
  {
    "nickname": "Green Arrow",
    "real_name": "Oliver Queen",
    "origin_description": "A billionaire playboy who becomes a vigilante archer, Oliver Queen fights crime with his skilled marksmanship.",
    "superpowers": "Expert archer, hand-to-hand combatant, skilled in martial arts.",
    "catch_phrase": "You have failed this city!",
    "Images": ["green_arrow.jpg"]
  },
  {
    "nickname": "Vision",
    "real_name": "Vision",
    "origin_description": "Created from the remnants of Ultron, Vision possesses the Mind Stone and seeks to understand humanity.",
    "superpowers": "Density control, flight, and energy manipulation.",
    "catch_phrase": "I am Vision.",
    "Images": ["vision.jpg"]
  },
  {
    "nickname": "Star-Lord",
    "real_name": "Peter Quill",
    "origin_description": "Half-human and half-Celestial, Peter Quill is the leader of the Guardians of the Galaxy.",
    "superpowers": "Expert pilot, skilled fighter, and user of advanced technology.",
    "catch_phrase": "I am Star-Lord!",
    "Images": ["star_lord.jpg"]
  },
  {
    "nickname": "Gamora",
    "real_name": "Gamora",
    "origin_description": "Raised as the daughter of Thanos, Gamora is a skilled assassin and member of the Guardians of the Galaxy.",
    "superpowers": "Enhanced strength, agility, and expert hand-to-hand combat skills.",
    "catch_phrase": "I am the deadliest woman in the galaxy.",
    "Images": ["gamora.jpg"]
  },
  {
    "nickname": "Rocket Raccoon",
    "real_name": "Rocket Raccoon",
    "origin_description": "A genetically modified raccoon and master of weaponry, Rocket is a key member of the Guardians of the Galaxy.",
    "superpowers": "Genius-level intellect, expert marksman, and master tactician.",
    "catch_phrase": "Ain't no thing like me, except me!",
    "Images": ["rocket_raccoon.jpg"]
  },
  {
    "nickname": "Daredevil",
    "real_name": "Matt Murdock",
    "origin_description": "Blinded by radioactive material, Matt Murdock develops enhanced senses and becomes the vigilante Daredevil.",
    "superpowers": "Heightened senses, expert martial artist, and acrobat.",
    "catch_phrase": "The man without fear.",
    "Images": ["daredevil.jpg"]
  },
  {
    "nickname": "She-Hulk",
    "real_name": "Jennifer Walters",
    "origin_description": "After receiving a blood transfusion from her cousin Bruce Banner, Jennifer Walters transforms into She-Hulk.",
    "superpowers": "Superhuman strength, durability, and expert lawyer.",
    "catch_phrase": "You wouldn’t like me when I’m angry.",
    "Images": ["she_hulk.jpg"]
  },
  {
    "nickname": "Captain Marvel",
    "real_name": "Carol Danvers",
    "origin_description": "After being exposed to alien technology, Carol Danvers becomes Captain Marvel, one of the universe's most powerful heroes.",
    "superpowers": "Superhuman strength, flight, and energy projection.",
    "catch_phrase": "Higher, further, faster.",
    "Images": ["captain_marvel.jpg"]
  },
  {
    "nickname": "Moon Knight",
    "real_name": "Marc Spector",
    "origin_description": "A former Marine and mercenary, Marc Spector becomes the Moon Knight after being resurrected by the Egyptian moon god Khonshu.",
    "superpowers": "Enhanced strength, agility, and expert combat skills.",
    "catch_phrase": "I am the night!",
    "Images": ["moon_knight.jpg"]
  },
  {
    "nickname": "Ghost Rider",
    "real_name": "Johnny Blaze",
    "origin_description": "After making a deal with the devil, stunt motorcyclist Johnny Blaze becomes the Ghost Rider, a supernatural avenger.",
    "superpowers": "Superhuman strength, regeneration, and the ability to control hellfire.",
    "catch_phrase": "I am Ghost Rider!",
    "Images": ["ghost_rider.jpg"]
  }
]
